In [1]:
import pandas as pd

In [2]:
df_customer= pd.read_csv("data\dim_customers.csv")

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\Rakesh Nath\AppData\Local\Temp\ipykernel_16696\3400783167.py:1: SyntaxWarning: invalid escape sequence '\d'
  df_customer= pd.read_csv("data\dim_customers.csv")

In [4]:
df_customer

,customer_id,age_group,city,occupation,gender,marital status,avg_income
0,ATQCUS1825,45+,Bengaluru,Salaried IT Employees,Male,Married,73523
1,ATQCUS0809,25-34,Hyderabad,Salaried Other Employees,Male,Married,39922
2,ATQCUS0663,25-34,Chennai,Salaried Other Employees,Male,Married,37702
3,ATQCUS0452,25-34,Delhi NCR,Government Employees,Male,Married,54090
4,ATQCUS3350,21-24,Bengaluru,Freelancers,Male,Single,28376
...,...,...,...,...,...,...,...
3995,ATQCUS3035,45+,Delhi NCR,Business Owners,Female,Married,72805
3996,ATQCUS2585,35-45,Mumbai,Salaried Other Employees,Female,Married,41343
3997,ATQCUS1229,35-45,Bengaluru,Salaried IT Employees,Male,Married,65948
3998,ATQCUS0581,25-34,Bengaluru,Government Employees,Male,Married,52589
3999,ATQCUS3477,25-34,Mumbai,Business Owners,Male,Single,73541

In [5]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customer_id     4000 non-null   object
 1   age_group       4000 non-null   object
 2   city            4000 non-null   object
 3   occupation      4000 non-null   object
 4   gender          4000 non-null   object
 5   marital status  4000 non-null   object
 6   avg_income      4000 non-null   int64
dtypes: int64(1), object(6)
memory usage: 218.9+ KB

In [11]:
df_customer["gender"].unique()

array(['Male', 'Female'], dtype=object)

In [12]:
df_customer["age_group"].unique()

array(['45+', '25-34', '21-24', '35-45'], dtype=object)

In [13]:
df_customer["city"].unique()

array(['Bengaluru', 'Hyderabad', 'Chennai', 'Delhi NCR', 'Mumbai'],
      dtype=object)

In [14]:
df_customer["occupation"].unique()

array(['Salaried IT Employees', 'Salaried Other Employees',
       'Government Employees', 'Freelancers', 'Business Owners'],
      dtype=object)

In [15]:
df_customer["marital status"].unique()

array(['Married', 'Single'], dtype=object)

In [16]:
df_customer.describe()

         avg_income
count   4000.000000
mean   51657.032250
std    14690.140645
min    24816.000000
25%    38701.000000
50%    50422.000000
75%    64773.250000
max    86600.000000

In [24]:
df_fact= pd.read_csv(r"data\fact_spends.csv")

In [25]:
df_fact

       customer_id      month           category payment_type  spend
0       ATQCUS1371       July  Health & Wellness  Credit Card   1114
1       ATQCUS0368    October          Groceries  Credit Card   1466
2       ATQCUS0595        May  Health & Wellness  Credit Card    387
3       ATQCUS0667    October        Electronics  Credit Card   1137
4       ATQCUS3477  September              Bills          UPI   2102
...            ...        ...                ...          ...    ...
863995  ATQCUS1993       June              Bills   Debit Card    897
863996  ATQCUS1063  September              Bills  Credit Card   2680
863997  ATQCUS0416     August             Others  Credit Card    270
863998  ATQCUS3361  September              Bills          UPI    446
863999  ATQCUS1736  September            Apparel          UPI    242

[864000 rows x 5 columns]

In [26]:
df_fact.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 864000 entries, 0 to 863999
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   customer_id   864000 non-null  object
 1   month         864000 non-null  object
 2   category      864000 non-null  object
 3   payment_type  864000 non-null  object
 4   spend         864000 non-null  int64
dtypes: int64(1), object(4)
memory usage: 33.0+ MB

In [30]:
df_fact["month"].unique()

array(['July', 'October', 'May', 'September', 'June', 'August'],
      dtype=object)

In [32]:
df_fact["payment_type"].unique()

array(['Credit Card', 'UPI', 'Debit Card', 'Net Banking'], dtype=object)

In [33]:
df_fact.describe()

               spend
count  864000.000000
mean      614.464994
std       661.571676
min         6.000000
25%       191.000000
50%       395.000000
75%       793.000000
max     10313.000000